Repository: soutys/django-carrots
Catalog: source/locale/*/LC_MESSAGES/install.po
Languages: pl

source: Installation
pl: Instalacja

source: Linux (Ubuntu, Fedora, etc.) or Mac
pl: Linux (Ubuntu, Fedora, etc.) lub Mac

source: Download and install the package for your system version from `python.org`_ .
pl: Ze strony `python.org`_ ściągnij i zainstaluj paczkę dla Twojej wersji systemu.

source: Other
pl: Inne

source: Tools
pl: Narzędzia

source: Windows command line
pl: Linia poleceń Windows

source: Text may be different depending on the version of Windows you use.
pl: Tekst może trochę się różnić w zależności od używanej wersji Windowsa.

source: Displays the contents of the current directory. For example, if the ``prompt`` shows ``C:\Users\Name``, the ``dir`` command displays the contents of our home directory.
pl: Wyświetla zawartość aktualnego katalogu. Przykładowo, jeżeli ``prompt`` pokazuje katalog ``C:\Users\Imie``, to polecenie ``dir`` wyświetli zawartość naszego katalogu domowego.

source: ``cd directory``
pl: ``cd katalog``

source: ``mkdir directory``
pl: ``mkdir katalog``

source: Creates a new directory.
pl: Tworzy nowy katalog.

source: Virtual environment
pl: Środowisko wirtualne

source: For example, if our home directory is ``C:\Users\lrekucki``, the command line would look like this:
pl: Na przykład, jeżeli naszym katalogiem domowym jest ``C:\Users\lrekucki``, linia poleceń będzie wyglądała tak:

source: The ``python`` command will run the correct version of Python, so we will not have to enter the full path at the beginning nor the version at the end.
pl: Komenda ``python`` będzie uruchamiała dobrą wersję Pythona, więc nie będziemy musieli ani dopisywać pełnej ścieżki na początku, ani wersji na końcu.

source: Ensure your terminal is well configured:
pl: Upewnij się, że wszystko działa jak należy:

source: Summary
pl: Podsumowanie

source: New virtual environment installation:
pl: Instalacja nowego środowiska wirtualnego:

source: Virtual environment activation:
pl: Aktywacja środowiska wirtualnego:

source: Just make sure that you use the proper Python version:
pl: Upewnij się, że używasz właściwej wersji pythona:

source: ``IPython`` installation:
pl: Zainstaluj ``IPython``:

source: For our workshop, we will need a Python 3.8.1 interpreter. Below are some directions on how to check if you already have the interpreter and how to install it along with some other tools.
pl: Na potrzeby warsztatów będzie nam potrzebny interpreter języka Python w wersji 3.8.1. Poniżej znajdują się wskazówki, jak sprawdzić, czy już go mamy, ewentualnie zainstalować wraz z przydatnymi narzędziami.

source: You can download Python for Windows directly from `python.org`_. After downloading the file ``*.msi``, open it and follow the instructions. It is important to remember the path of installation – the directory – as we will need this information during the :ref:`installation of tools <tools>`.
pl: Wersje dla Windows można pobrać bezpośrednio ze strony `python.org`_. Po ściągnięciu pliku ``*.msi`` uruchom go i postępuj zgonie z instrukcjami. Ważne jest, aby zapamiętać ścieżkę, którą wybraliśmy jako katalog instalacji, bo będzie nam ona potrzebna przy :ref:`instalacji narzędzi <tools>`.

source: In order to check our version of Python, enter the following in the command line:
pl: Aby sprawdzić czy i jaką wersję mamy, wpisz w linii poleceń:

source: If the ``python`` command is not available or the wrong version appears:
pl: Jeśli nie ma dostępnej komendy ``python`` lub wyświetla ona nieodpowiednią wersję:

source: Enter in the command line::
pl: Wpisz w linii poleceń::

source: Use the system of packages adequate for your distribution. If there is no adequate system or you cannot find python, you can install it using the sources on the `python.org`_. website. A compiler and readline library will be required.
pl: Użyj systemu paczek odpowiedniego dla Twojej dystrybucji. Jeśli takiego nie ma lub nie możesz znaleźć Pythona, to możesz go zainstalować, używając źródeł za strony `python.org`_. Wymagany będzie kompilator i biblioteka readline.

source: Unofficially, we assume that the users of less popular (but not worse!) distributions will manage the task without any problem :).
pl: Po cichu zakładamy, że użytkownicy mniej popularnych (nie znaczy, że gorszych!) dystrybucji Linuksa na pewno sobie poradzą z tym zadaniem :).

source: We will do most of our work on the command line. To activate the command line in Windows, press ``Win+R``. In the open window, type ``cmd`` and click ``OK``. A new window will appear with white text on a black background:
pl: Większość pracy będziemy wykonywać z linii poleceń. Aby uruchomić linię poleceń pod Windowsem wciśnij ``Win+R``. W otwartym oknie wpisz ``cmd`` i wciśnij ``OK``. Pojawi się nowe okno z białym tekstem na czarnym tle.

source: ``C:\Users\Name>`` is a prompt. It informs us of the directory (or folder) in which we currently are and waits for a command. Later during the workshop ``C:\Users\Name>`` we will refer to it with ``~$``, independently of your operating system (Windows, Linux, MacOS).
pl: ``C:\Users\Name>`` to tak zwany ``prompt``. Informuje nas o katalogu (folderze), w którym aktualnie się znajdujemy oraz czeka na podanie polecenia. W dalszej części warsztatów ``C:\Users\Name>`` będziemy skracać do ``~$``, niezależnie od używanego systemu (Windows, Linux, MacOS).

source: Using the command line, you can move around the contents of the disc (in the same way as in ``My Computer``). You can do that by entering commands and pressing ``Enter``. Use the following commands:
pl: Używając linii poleceń możesz poruszać się po zawartości dysku (podobnie jak przez ``Mój komputer``). Możesz to zrobić przez wpisanie polecenia i wciśnięcie ``Enter``. Oto kilka przydatnych poleceń:

source: Changes the current directory. For example, if you are in ``C:\Users\Name``, you can access the directory with your documents by entering ``cd Documents``. If you execute the ``dir`` command, you will see something familiar. The command ``cd ..`` will move you one level up in the directory tree, that is, to the directory that contains your current directory.
pl: Służy do zmiany aktualnego katalogu. Przykładowo, jeśli jesteśmy w katalogu ``C:\Users\Name``, aby przenieść się do katalogu z naszymi dokumentami należy wykonać ``cd Documents``. Jeśli teraz wykonasz polecenie ``dir``, zobaczysz coś znajomego.Polecenie ``cd ..`` przeniesie Cię jeden poziom wyżej w drzewie katalogów, a dokładniej: do katalogu, który zawiera twój bieżący katalog.

source: Now we have to chose the directory for our virtual environment. The virtual environment will allow us to isolate our work from other parts of the system. For example, you can choose the user home directory.
pl: Musimy wybrać teraz katalog dla naszego środowiska wirtualnego. Środowisko wirtualne pozwala odizolować naszą pracę od innych części systemu. Może być to, przykładowo, katalog domowy użytkownika.

source: For Windows 7 the path to the home directory for the user ``Ala`` will look like this: ``C:\Users\Ala\`` . You can select a different directory, but it is important to remember where the file is saved. It must be easily accessible, because we will use it often.
pl: W przypadku Windowsa 7 ścieżka do katalogu domowego dla użytkownika ``Ala`` będzie wyglądała tak: ``C:\Users\Ala\``. Możesz wybrać też inny katalog, ale ważne jest, żeby zapamiętać, gdzie zapisują się pliki. Powinna to być lokalizacja łatwo dostępna gdyż będziemy jej często używać.

source: In your home directory we will create a ``workshops`` directory containing the so called *virtual environment*. For now, it is important to activate it:
pl: W Twoim katalogu domowym powstanie katalog ``warsztaty`` zawierający tzw. wirtualne środowisko. Na razie istotne jest dla nas tylko to, że musimy je aktywować:

source: If you can't find your ``pip`` or there is a problem after typing ``which pip`` (``where pip`` on windows), you may need to reinstall pip:
pl: Jeśli nie możesz znależć polecenia ``pip`` lub wystąpiły problemy po wpisaniu ``which pip`` (``where pip`` na windows) może zajść potrzeba przeinstalowania pip:

source: Optionally, you can install ``IPython``, which improves the look and comfort when using Python from the console.
pl: Opcjonalnie możesz zainstalować ``IPython``, który poprawi wygląd i komfort używania konsoli Pythona.
