Repository: soutys/django-carrots
Catalog: source/locale/*/LC_MESSAGES/python_quickstart.po
Languages: pl

source: To write such a program, we need to learn how to use the functions. The first function we are going to learn is :func:`help`:
pl: Aby móc napisać taki program, musimy nauczyć się operowania funkcjami. Pierwszą, która poznamy, będzie :func:`help`:

source: The :func:`help` function is very friendly and tells us how we should use it. It can also tell you how to use the other functions:
pl: :func:`help` jest bardzo przyjazną funkcją, bo sama nam mówi, jak powinniśmy jej używać. Pomaga też w zrozumieniu innych funkcji:

source: We will use :func:`input` to load data from the user. As we read in the description, :func:`input` reads the string:
pl: Właśnie :func:`input` będziemy używać do wczytywania danych od użytkownika. Jak czytamy w opisie, :func:`input` wczytuje napis:

source: Now you will learn what "calling a function" means. You can call a function using ``()``, which is an information for the interpreter to call a function. Calling a function will run a function. If you forget to type ``()`` after the function name, the function is not called. In this situation, you will not get any informations about errors, because the command you typed is still correct.
pl: W tym momencie zapoznamy się z "wywoływaniem funkcji". Robi się to za pomocą nawiasów ``()``, które informują interpreter, że ma daną funkcję wywołać. Wywołanie funkcji spowoduje uruchomienie jej. Jeżeli zapomnimy wpisać ``()`` po nazwie funkcji, nie zostanie ona wywołana i **nie** dostaniemy żadnego błędu (ponieważ jest to ciągle poprawny program).

source: Generally, function calls **return** some values. The :func:`input` function returns a string, that’s why we can use it the same way that we used strings before.
pl: Wywołane funkcje najczęściej **zwracają** jakąś wartość. Funkcja :func:`input` zwraca napis, dlatego możemy użyć jej wszędzie tam gdzie do tej pory używaliśmy napisów.

source: For example, we can use ``input()`` to save a given string as a name:
pl: Przykładowo możemy użyć ``input()`` by zapamiętać wczytany napis pod jakąś nazwą:

source: The :func:`help` function does not hesitate to inform us that, in fact, :func:`int` and :func:`float` are not functions but classes (we will talk about those later), hence the information about all the other things that you can use them for. For now, we are only interested in the basic functionality of converting strings into numbers of a determined type.
pl: Funkcja :func:`help` nie omieszkała nas poinformować, iż w rzeczywistości :func:`int` i :func:`float` nie są funkcjami, lecz klasami (o czym będzie więcej później) - stąd też informacja na temat wszystkich innych rzeczy, do których można ich użyć. Nas na razie interesuje jedynie podstawowa funkcjonalność zamiany napisów na liczby odpowiedniego typu.

source: You can save this program to ``bmi.py`` and run ``python bmi.py``. The result should look like this:
pl: Powyższy program możesz zapisać do pliku ``bmi.py`` i uruchomić ``python bmi.py``. W efekcie powinniśmy dostać:

source: In conclusion, to call a function we need to know its name (until now we learnt a bunch of functions: :func:`print`, :func:`help`, :func:`input`, :func:`int`, :func:`float` and :func:`quit`), and what data it expects from us (called the list of arguments).
pl: Podsumowując: aby wywołać funkcję, musimy znać jej nazwę (poznaliśmy dotąd część: :func:`print`, :func:`help`, :func:`input`, :func:`int`, :func:`float` i :func:`quit`), oraz wiedzieć, jakich danych ona od nas oczekuje (tzw. lista argumentów).

source: In order to call the function, we must put parentheses after its name:
pl: Aby wywołać funkcję, musimy dopisać nawiasy po jej nazwie:

source: Now Python will execute the function.
pl: W tym momencie funkcja zostanie wykonana przez Pythona.

source: We need to use the *conditional statement* :keyword:`if`. It will execute the rest of the program depending on a given condition:
pl: Skorzystamy więc z tzw. instrukcji warunkowej :keyword:`if`, która wykonuje dalszą część programu pod podanym warunkiem:

source: Let us now talk about comparisons. Let's look at how they behave in a short math lesson:
pl: Kolejnym elementem, o którym jeszcze nie wspomnieliśmy, są porównania. Dla liczb działają one identycznie jak na lekcjach matematyki:

source: The result of a comparison is always ``True`` or ``False``. Comparisons can be combined into more complex conditions by using the words :keyword:`and` and :keyword:`or`:
pl: Wynikiem porównania jest zawsze ``True`` albo ``False``. Porównania można łączyć w bardziej skomplikowane warunki za pomocą słów :keyword:`and` oraz :keyword:`or`:

source: Another thing you should pay attention to is the indentation in the code. Open the interactive mode and enter a simple condition such as::
pl: Kolejna rzecz, na którą warto zwrócić uwagę, to wcięcia w kodzie. Otwórz tryb interaktywny i wpisz prosty warunek, np.::

source: So far nothing has happened, as evidenced by dots ``...`` instead of a prompt ``>>>``, which we have seen so far. Python expects us to give further instructions that are supposed to be executed if the condition ``2 > 1`` turns out to be true. Let’s try to make Python print "OK"::
pl: Na razie nic się jeszcze nie wydarzyło, o czym świadczą kropki ``...`` zamiast zachęty ``>>>``, którą dotąd widzieliśmy. Python oczekuje od nas dalszych instrukcji, które mają być wykonane, jeśli warunek ``2 > 1`` okaże się prawdziwy. Sprawmy, żeby wypisał "OK"::

source: Unfortunately, we did not succeed. Python needs to know whether the instruction we have written is a continuation of :keyword:`if` or it is the next instruction not covered by the condition. To this purpose, we need to indent our code:
pl: Niestety, nie udało się nam. Python musi wiedzieć, czy instrukcja, którą wpisaliśmy, jest kontynuacją :keyword:`if` czy kolejną instrukcją nieobjętą warunkiem. W tym celu musimy wciąć nasz kod:

source: All you need is one space or ``TAB``. However, all the lines that are supposed to be executed one after another should be indented the same way::
pl: Wystarczy do tego jedna spacja albo ``TAB``. Jednak wszystkie linie, które mają się wykonywać po sobie, muszą być wcięte tak samo::

source: To avoid chaos, most Python programmers use four spaces for each level of indentation. We will do the same:
pl: Aby uniknąć chaosu, większość programistów Pythona używa czterech spacji na każdy poziom wcięcia. My też będziemy tak robić:

source: We can also use :keyword:`else` and :keyword:`elif` to avoid repeating similar conditions and increase readability. In more complex programs it may not be obvious from the beginning that a certain condition is the opposite of the previous one.
pl: Jednak użyliśmy jeszcze :keyword:`else` i :keyword:`elif`, aby nie musieć powtarzać podobnych warunków oraz zwiększyć czytelność. W bardziej skomplikowanych programach może nie być oczywiste na pierwszy rzut oka, że kolejny warunek jest przeciwieństwem poprzedniego.

source: Pay particular attention to the indentations. Every use of :keyword:`else`, will cause an increased indentation of our code. It is very annoying when you have to check a few or a dozen or so conditions which exclude one another . Therefore the authors of Python added a little 'improvement' in the form of :keyword:`elif`, instruction, which allows you to check another condition immediately::
pl: Zwróć szczególną uwagę na wcięcia. Każde użycie :keyword:`else`, będzie powodować, że nasz kod będzie coraz bardziej wcięty. Jest to bardzo uciążliwe, gdy mamy do sprawdzenia kilka czy kilkanaście wykluczających się warunków. Dlatego autorzy języka dodali drobne "usprawnienie" w postaci instrukcji :keyword:`elif`, która pozwala od razu sprawdzić kolejny warunek::

source: Well, almost... .We still have too many digits. We would also have a problem if we wanted to generate such a string and save with a name, because we use :func:`print` to separate the elements. Fortunately, there is a better way:
pl: No prawie, nadal mamy zbyt dużo cyfr. W dodatku mielibyśmy problem, gdybyśmy chcieli np. wygenerować taki napis i zapamiętać pod jakąś nazwą, bo korzystamy z :func:`print` do rozdzielania elementów. Na szczęście jest lepszy sposób:
