Repository: soutys/django-carrots
Catalog: source/locale/*/LC_MESSAGES/python_quickstart.po
Languages: pl

source: Introduction to Python
pl: Wprowadzenie do Pythona

source: Let’s start with running the Python interpreter we installed in the previous chapter. Please run:
pl: Zacznijmy od uruchomienia interpretera, który zainstalowaliśmy w poprzednim rozdziale. Uruchom:

source: Now we can count something, for example: ``2 + 2``:
pl: Teraz możemy coś policzyć, np. wpisując ``2 + 2``:

source: Python is excellent as a calculator:
pl: Python świetnie sprawdza się jako kalkulator:

source: Introduce yourself
pl: Przedstaw się

source: Strings
pl: Napisy

source: Numbers, however, are not enough to communicate effectively. So we need to learn how to use ``strings`` . Here are some examples:
pl: Same liczby to jednak trochę za mało do skutecznego porozumiewania się. Musimy więc nauczyć się posługiwać napisami (ang. ``string``). Oto kilka przykładów:

source: You can also add strings as follows:
pl: Napisy można również dodawać:

source: or they can be multiplied by whole numbers:
pl: oraz mnożyć przez liczby całkowite:

source: Printing the strings
pl: Drukowanie napisów

source: :func:`print` command has many more applications as it can write almost everything. For now, the only other kind of values we know are numbers:
pl: Funkcja :func:`print` ma też dużo więcej zastosowań, bo potrafi wypisać niemalże wszystko. Na razie jedynym innym znanym nam rodzajem wartości są liczby:

source: Source files
pl: Pliki źródłowe

source: BMI calculator
pl: Kalkulator BMI

source: Now we are going to write a simple program to calculate `BMI` (`Body Mass Index`_). The formula for its calculation is as follows::
pl: Teraz napiszemy prosty program do kalkulacji `BMI` (`Body Mass Index`_). Formuła do jego obliczenia jest następująca:

source: Run our new program with::
pl: Uruchom program::

source: We get the following result:
pl: W wyniku dostaniemy:

source: As you can see, our program still needs some improvements:
pl: Jak widać, nasz program wymaga jeszcze nieco pracy:

source: Printing so many decimal places is unnecessary. BMI is measured with an accuracy of two decimal places.
pl: Wypisywanie tylu miejsc po przecinku jest zbędne. BMI mierzy się z dokładnością do dwóch miejsc po przecinku.

source: Names
pl: Nazwy

source: That's why we give names to these values​​:
pl: Dlatego nadamy tym wartościom nazwy:

source: The result has not changed:
pl: Wynik działania programu się nie zmienił:

source: One value can have many names:
pl: Możemy nadać wiele nazw tej samej wartości:

source: We also can change the value assigned to the name. The new value does not need to be of the same type as the old one:
pl: Możemy też dowolnie zmieniać wartość przypisaną do nazwy. Nie musi ona być tego samego typu, co poprzednio:

source: As we have seen in our program, we can also give names to the results of calculations and use names in calculations:
pl: Jak już widzieliśmy w naszym programie, nazwy możemy nadawać też wynikom obliczeń oraz używać nazw w obliczeniach:

source: Until we give the Python the command to repeat the calculation again:
pl: Dopóki nie każemy Pythonowi wyliczyć jej ponownie:

source: Now is time to add some comments to our program so that the user (and us too!) remembers that the weight has to be given in kilograms.
pl: Na koniec tego rozdziału dodamy kilka komentarzy do naszego programu, aby użytkownik (włącznie z nami!) pamiętał, że wagę należy podać w kilogramach.

source: Calling a function
pl: Wywoływanie funkcji

source: Is that enough to improve our program?
pl: Czy to już wystarcza nam do poprawienia programu?

source: As you can see, Python doesn’t know what result we expect. Both strings (``str``), and numbers (``int``) can't be added together. Python does not know if we are referring to the number ``63.5`` or to the string ``"60.5"``. Only we know that, so we have to include this information in the program.
pl: Jak widać, Python nie wie, o co nam chodzi i jakiego właściwie wyniku oczekujemy. Jak pokazaliśmy wcześniej, zarówno napisy (``str``), jak i liczby (``int``) można do siebie dodawać. Python nie wie, czy chodzi nam o liczbę ``63.5``, czy o napis ``"60.53"``. Tylko my to wiemy i musimy zawrzeć tę informację w programie.

source: Let’s introduce two more functions:
pl: Poznajmy więc dwie kolejne funkcje:

source: and
pl: oraz

source: Let’s test :func:`int` and :func:`float`:
pl: Przetestujmy :func:`int` i :func:`float`:

source: Before we use the newly learnt functions in our program, let’s make a plan of how it should work:
pl: Zanim skorzystamy z nowo poznanych funkcji w naszym programie, skonstruujmy oczekiwany plan jego działania:

source: Ask the user to enter the height.
pl: Poproś użytkownika o podanie wzrostu

source: Ask the user to enter the weight.
pl: Poproś użytkownika o podanie wagi

source: Print the calculated BMI.
pl: Wypisz obliczone BMI

source: It should not surprise us that these eight points can be directly translated into eight lines of our program (not counting spaces):
pl: Nie powinno nas zaskoczyć, że te osiem punktów można wprost przełożyć na osiem linii naszego programu (nie licząc odstępów):

source: Entering just the name does not activate the function. It will tell us only that it is a function:
pl: Podanie samej nazwy nie wywoła funkcji, powie nam jedynie, że to funkcja:

source: All arguments are given in parentheses. To specify more than one, separate them with a comma:
pl: Wszystkie argumenty podajemy w nawiasach. Aby podać więcej niż jeden, rozdzielamy je przecinkiem:

source: Checking conditions
pl: Sprawdzanie warunków

source: Let’s go to our next problem. We want our program to print the appropriate classification for the calculated BMI by using the table below:
pl: Przejdźmy do naszego następnego problemu. Chcemy, aby nasz program, korzystając z poniższej tabeli, wypisał odpowiednią dla obliczonego BMI klasyfikację:

source: Classification
pl: Klasyfikacja

source: underweight
pl: niedowaga

source: normal weight
pl: waga prawidłowa

source: overweight
pl: nadwaga

source: Comparisons: true or false?
pl: Porównania: prawda czy fałsz?

source: Indentations
pl: Wcięcia

source: What if not?
pl: Co, jeśli nie?

source: Actually, we could write our program just by using :keyword:`if` ::
pl: Samo :keyword:`if` właściwie by nam wystarczyło do napisania naszego programu::

source: Using :keyword:`else` , we have the guarantee that the given instructions will be executed only if the instructions printed under :keyword:`if` haven’t been executed::
pl: Korzystając z :keyword:`else` mamy gwarancję, że podane tam instrukcje zostaną wykonane tylko jeśli nie zostały wykonane instrukcje wpisane pod :keyword:`if`::

source: Strings formatting
pl: Formatowanie napisów

source: The last issue which we have mentioned above was the problem with too many digits in a printed BMI. Out of the three problems we had, this one is the easiest to solve.
pl: Ostatnim problemem, o którym wspomnieliśmy, była zbyt duża ilość cyfr w wypisywanym BMI. Ze wszystkich trzech jest on najprostszy do rozwiązania.

source: That’s why we left it for the end of our "adventure" with the BMI calculator. We already know that we can add strings to each other and multiply them by integers. You will see that we can also format them. But first we will need one more type of data (except the strings and the numbers we already know).
pl: Dlatego zostawiliśmy go sobie na koniec naszej "przygody" z kalkulatorem BMI. Wiemy już, że napisy można dodawać do siebie oraz mnożyć przezliczby całkowite. Zaraz zobaczymy, że można też wykonać na nich operacjęformatowania. Jednak najpierw potrzebny nam będzie jeszcze jeden typdanych (oprócz napisów i liczb, które już znamy).

source: Tuples
pl: Krotki

source: At the beginning we mentioned that we can not use commas in numbers, because we will need them later while using tuples. And here they are:
pl: Na samym początku wspomnieliśmy już, że nie możemy używać przecinka w liczbach, bo będzie nam potrzebny później do krotek. A oto i one:

source: A tuple is nothing more than a few values grouped into one. The values we want to group should be separated by commas. The whole thing can be enclosed in parentheses to make it more clear, but it is not required. Except when we want to group none of the elements (however strange it may sound):
pl: Krotka to nic innego jak kilka wartości zgrupowanych w jedną. Wartości, które chcemy zgrupować, rozdzielamy przecinkami. Dla zwiększenia czytelności możemy całość otoczyć nawiasami, ale nie jest to konieczne - z wyjątkiem przypadku, gdy chcemy zgrupować zero elementów (jakkolwiek dziwnie może to brzmieć):

source: Tuples can be combined:
pl: Krotki można ze sobą łączyć:

source: They may also contain other tuples e.g. information on a point on the map can be grouped as follows:
pl: Mogą też zawierać inne krotki, np. informację o punkcie na mapie możemy zgrupować w następujący sposób::

source: where ``x`` and ``y`` are numbers.
pl: gdzie ``x`` i ``y`` to jakieś liczby.

source: We can refer to the grouped values by using their positions in the tuple (counting form zero) e.g.:
pl: Do zgrupowanych wartości możemy odwołać się używając ich pozycji w krotce (licząc od zera), np.:

source: Formatting
pl: Formatowanie

source: Going back to our program: currently the result is reduced to a single line. Now we want to write the BMI as a number and the interval in which it is located, that is to say::
pl: Wracając do naszego programu: aktualnie jego wynik sprowadza się do jednej linijki. Teraz chcemy wypisać zarówno BMI jako liczbę oraz przedział, w którym się mieści, tj.::

source: Modify the current program so that the calculated BMI would be available under the name of ``bmi``,and the name of the interval under the name of ``category``. Then we can use :func:`print` and obtain the required result:
pl: Zmodyfikuj aktualny program tak, aby obliczone BMI było dostępne pod nazwą ``bmi``, a nazwa przedziału pod nazwą ``category``. Wtedy będziemy mogli użyć :func:`print` i uzyskać pożądany wynik:

source: We have here a string and a tuple joined by ``%``. The string is a template which will be completed with values from the tuple. The spaces to be filled are also labeled with the percentage (``%``). . The letter that follows defines the type of a value we want to insert. The integers are represented by ``i`` as **integer** (we can also use ``d`` as **decimal**), strings are represented by ``s`` as **string**, and floating-point numbers are represented by ``f`` for **float**:
pl: Mamy tutaj napis i krotkę połączone znakiem ``%``. Napis jest szablonem, który będziemy wypełniać wartościami z krotki. Miejsca do wstawienia oznaczone są również procentem (``%``). Następująca po nim litera określa jakiego rodzaju wartość będziemy chcieli wstawić w to miejsce. I tak, liczbom całkowitym odpowiada ``i`` jak **integer** (zamiennie używa się też ``d`` jak **decimal**), napisom ``s`` jak **string**, a liczbom zmiennoprzecinkowym ``f`` jak **float**:

source: Now instead of nine decimal places we always get six, but the formatting has the advantage that it allows us to have more control by putting between ``%`` and ``f`` additional information, e.g. if you want to display only two places after the decimal point:
pl: Teraz zamiast dziewięciu miejsc po przecinku zawsze dostajemy sześć, jednak formatowanie ma tę zaletę, że pozwala nam na większą kontrolę poprzez wstawienie pomiędzy ``%`` a znak ``f`` dodatkowych informacji, np. jeśli chcemy wyświetlić tylko dwa miejsca po kropce:

source: There are plenty options of formatting, so we will not show them all here. One of the most useful is the option of aligning to a specific number of characters:
pl: Opcji formatowania jest mnóstwo, więc nie będziemy ich tu wszystkich pokazywać. Jedną z bardziej przydatnych jest wyrównanie do konkretnej liczby znaków:

source: We can also align the string ``-`` to the left by putting before the number of characters:
pl: Możemy też wyrównać napis do lewej dodając ``-`` przed liczbą znaków:

source: Aligning towards the centre is an additional excercise for you :).
pl: Wyrównanie na środek pozostawiamy jako ćwiczenie dla czytelnika. ;)

source: In this chapter we learned basics of Python syntax. We discovered how to print integers, floating-point numbers, strings and tuples.
pl: W tym rozdziale poznaliśmy podstawy składni Pythona. Wiemy jak zapisać liczby całkowite, liczby zmiennoprzecinkowe, napisy oraz krotki z nich złożone.

source: We learnt the function :func:`print`, that prints information for the user and the function :func:`input`, which reads it.
pl: Poznaliśmy funkcję :func:`print`, która wypisuje informacje użytkownikowi oraz funkcję :func:`input`, która je od niego wczytuje.

source: We also know now that indentations can be important, especially when we want to use the instruction :keyword:`if` (also in connection with :keyword:`else` and :keyword:`elif`).
pl: Wiemy też, że wcięcia mogą mieć znaczenie, szczególnie gdy chcemy użyć instrukcji :keyword:`if` (również w połączeniu z :keyword:`else` i :keyword:`elif`).

source: We successfully created a program stored in a file and ran it. Our program asks the user to answer a few simple questions, performs calculations and presents results in the form which is useful for the user.
pl: Umiemy stworzyć plik z programem i go uruchomić. Nasz program prosi użytkownika, aby odpowiedział na kilka prostych pytań, wykonuje obliczenia i prezentuje wynik w użytecznej dla niego formie.

source: This is quite a lot like for a first program. We still have a lot of work, anyhow you can be proud of what we have done so far!
pl: Całkiem sporo jak na nasz pierwszy program. Przed nami jeszcze dużo pracy, ale jak najbardziej możemy być dumni z tego co udało nam się zrobić do tej pory.

source: Load the string from the user and save it under the name ``height``.
pl: Wczytaj od użytkownika napis i zapamiętaj go pod nazwą ``height``

source: Change the string with the number to a number with a fraction.
pl: Zamień napis na liczbę z ułamkiem

source: Load the string from the user and save it under the name of ``weight``.
pl: Wczytaj od użytkownika napis i zapamiętaj pod nazwą ``weight``

source: Using the remembered values calculate BMI and save as ``bmi``.
pl: Korzystając z zapamiętanych wartości, oblicz BMI i zapamiętaj jako ``bmi``

source: Earlier we were working in the operating system's command line and we could give commands. The prompt was ``~$``. After running the ``python`` command, the prompt changed to ``>>>``. For us, that means that for now we may only use commands from the Python language. Recent commands ( such as: ``cd``, ``mkdir``) will not work. This is the moment when we start to learn a new language!
pl: Wcześniej pracowaliśmy w konsoli systemu operacyjnego i mogliśmy wydawać mu polecenia. Zachętą dla nas był ``~$``. Po uruchomieniu polecenia ``python`` zmienił się znak zachęty na ``>>>``. To jest informacja dla nas, że teraz wydajemy wyłącznie polecenia w języku Python. Poprzednie polecenia (takie jak: ``cd``, ``mkdir``) nie będą działać. W tym momencie zaczynamy uczyć się nowego języka!

source: We don't type the prompt ``>>>`` (the same as with ``~$``) - the interpreter will do that for us.
pl: Znaków ``>>>`` (podobnie jak ``~$``) nie wpisujemy - interpreter wpisze je za nas.

source: Please pay special attention when writing decimals: use a period, not a comma. Commas will be used to define :ref:`tuple <bmi-tuples>` (but more on that later).
pl: Należy zwrócić szczególną uwagę, że ułamki dziesiętne zapisujemy zgodnie z zasadami języka angielskiego, czyli z kropką, a nie z przecinkiem. Przecinki będą nam służyły do definiowania :ref:`krotek <bmi-tuples>` (ang. ``tuple``), ale o tym później.

source: The string must always begin and end with the same character. This may be a single quote (``'``) or double quotes (``"``). It has no effect on the value of the string, i.e, typing ``"Batman"`` creates a string ``Batman`` - quotes are not a part of it, they only indicate that it is a string ( unfortunately, Python is not so clever as to guess it by itself).
pl: Napis zawsze musi zaczynać się i kończyć tym samym znakiem. Może to być apostrof (``'``) albo cudzysłów (``"``). Nie ma to wpływu na wartość napisu, tzn. wpisując ``"Batman"`` tworzymy napis ``Batman`` - cudzysłowowy nie są jego częścią, służą jedynie wskazaniu, że jest to napis (niestety, Python nie jest aż tak sprytny, aby się tego domyślić).

source: How do we present values in a readable form? We can do it by using the :func:`print` command:
pl: Jak w takim razie przedstawić wartość w postaci czytelnej dla człowieka? Do tego posłuży nam funkcja :func:`print`:

source: In a similar way, we can write several strings in a single line without adding them to each other. They will be separated by spaces:
pl: Możemy w ten sposób wypisać kilka napisów w jednej linii, bez dodawania ich do siebie. Zostaną one oddzielone od siebie spacjami:

source: We are done with the interactive console for now. To exit it enter `quit()`::
pl: Na razie na tym skończymy naszą pracę z konsolą interaktywną. Aby z niej wyjść, wpisz poprostu `quit()`::

source: Or hold ``Ctrl+D`` (for Linux) or ``Ctrl+Z`` (for Windows).
pl: Lub (szybciej) wciskając na klawiaturze ``Ctrl+D`` w przypadku Linuxa lub ``Ctrl+Z`` w przypadku Windowsa.

source: So far, our code was executed in an interactive mode where we give commands separately and immediately get an answer. It’s a great way to experiment and learn new language elements, which is why we will get back to it eventually.
pl: Do tej pory cały nasz kod wykonywany był w tzw. trybie interaktywnym, w którym podajemy komendy pojedynczo i natychmiast dostajemy na nie odpowiedź. Jest to świetny sposób na eksperymentowanie i poznawanie nowych elementów języka, więc jeszcze do niego wrócimy.

source: Our first program will look like this::
pl: Nasz pierwszy program będzie wyglądać tak::

source: In order to write and save code in a file we need to use a text editor. Find a text editor that works on your OS (see `list of text editors on Wikipedia <https://en.wikipedia.org/wiki/List_of_text_editors>`_ for examples). Type the above Python code and save it in a new file called ``visitingcard.py``. Then run your first Python program, from the command line, using the following:
pl: Zapisz ten program w pliku ``visitingcard.py``, a następnie uruchom go z linii poleceń wykonując polecenie jak niżej:

source: A single program can contain more than one command. Each should be on a separate line. For example::
pl: Pojedynczy program może zawierać więcej niż jedno polecenie. Każde powinno znajdować się w osobnej linii, np.::

source: We can insert blank lines wherever we want in ``visitingcard.py`` file to increase its readability. Here, we split the message header from the content and the end.
pl: Puste linie pozwalają oddzielić wizualnie różne części programu, tak aby ułatwić rozczytanie jego treści. Tutaj rozdzieliliśmy nagłówek wiadomości od jej treści i zakończenia.

source: We already know how to divide, exponentiate, and print out numbers. Let's create a new file called ``bmi.py`` and write a program that calculates our BMI:
pl: Umiemy juź dzielić, potęgować i wypisywać liczby. Stwórzmy więc nowy plik o nazwie ``bmi.py`` i spróbujmy napisać program obliczający nasze BMI:

source: If someone else would like to use this program, we must change the contents of the ``bmi.py`` file.
pl: Jeśli ktoś inny chciałby skorzystać z tego programu, musimy zmienić zawartość pliku ``bmi.py``.

source: To someone who does has not memorized the BMI table, the value 21.387755102 won’t mean anything.
pl: Osobie, która nie zna na pamięć tabelki BMI, wartość 21.387755102 nic nie powie.

source: Programming is the art of solving problems, so... let's get to work! It will give us an opportunity to learn about some new features of Python.
pl: Ale programowanie to w końcu sztuka rozwiązywania problemów, więc do dzieła! Przy okazji poznamy kilka nowych elementów Pythona.

source: Let's try to solve the first problem. We would like to make our program more readable, i.e. so that for the person reading the results, it would be obvious which value is the weight and which is the height.
pl: Spróbujmy więc rozwiązać pierwszy problem. Na początek chcielibyśmy, aby nasz program był bardziej czytelny, tj. aby dla czytającego było oczywiste, która wartość to waga, a która wzrost.

source: In order to better understand how names work, let’s go back to the interactive mode for a while and give names to some values:
pl: Aby lepiej zrozumieć działanie nazw, wróćmy na chwilę do trybu interaktywnego i nadajmy kilka nazw wartościom:

source: The names are independent of each other. We have just assigned a new value to ``x``, but the value assigned to ``y`` remains unchanged:
pl: Nazwy są niezależne od siebie. Przed chwilą przypisaliśmy do ``x`` nową wartość, jednak wartość przypisana do ``y`` pozostaje bez zmian:

source: For those who already know other programming languages.
pl: Dla tych, którzy znają już inne języki programowania.

source: You probably wonder why we do not use the term "variable". This is because the names in Python do not work in the same way as variables. In most languages, the operation ``y = x`` would create a copy of ``x`` and would introduce it in the variable ``y``.
pl: Pewnie dziwi Cię, dlaczego nie używamy pojęcia "zmienna". To dlatego, że nazwy w Pythonie nie działają tak samo jak zmienne. W większości języków operacja ``y = x`` stworzyłaby kopię wartości ``x`` i wstawiła ją do zmiennej ``y``.

source: In Python, nothing is silently copied. ``y`` only becomes an alternative name for the same value. If you change this value, both ``x``, and ``y`` will show the same thing.
pl: W Pythonie nic nie jest po kryjomu kopiowane. ``y`` staje się jedynie alternatywną nazwą dla tej samej wartości. Jeśli zmienimy tę wartość, tak ``x``, jak i ``y`` pokażą to samo.

source: In our example we did not change the value of the number ``42``, but only the value assigned to ``x`` (the values of numbers are not modified despite the fact that in 1897 the lower house of the state of Indiana voted to change the value of the number π to ``3`` - which was rejected in the Senate). Therefore, ``print(y)`` will give us ``42``.
pl: W naszym przykładzie nie zmieniliśmy wartości liczby ``42``, a jedynie wartość przypisaną do ``x`` (w szczególności wartości liczb są niezmienne, choć w 1897 r. izba niższa stanu Indiana zatwiedziła zmianę wartości liczby pi na ``3`` - wniosek upadł dopiero w Senacie). Dlatego ``print(y)`` da nam ``42``.

source: Once a value is calculated, it is not modified:
pl: Raz wyliczona wartość już się nie zmienia:

source: Comments allow us to put arbitrary text in our python program. Comments will be ignored by the interpreter.
pl: Komentarze pozwalają umieścić w skrypcie pythonowym dowolny tekst. Komentarze zostaną zignorowane przez interpreter.

source: A comment in Python is everything after the character ``#`` until the end of the line::
pl: Komentarzem w Pythonie jest wszystko po znaku ``#`` aż do końca linii::

source: Our program looks good, but if a user wants to calculate his/her BMI, they still have to change the content of the program. It would be more convenient to enter the required values in the console after opening the program and get the BMI result.
pl: Nasz program wygląda już dobrze, ale użytkownik chcąc policzyć swoje BMI, nadal musi zmieniać treść programu. Wygodniej byłoby, gdyby po uruchomieniu programu mógł wpisać wymagane wartości w konsoli i odczytać swoje BMI.
